//
//  main.swift
//  Lesson1
//
//  Created by Air on 04.03.2021.
//

import Foundation
print("У нас есть квадратное уравнение вида (3x^2) - 5x +2");
print("Значит корни уравнения будут равны: ");
var x2: Double = -4;
var y2: Double = 6;
var z2: Double = x2 / y2;

var x3 = (-5 - 1)/6;

print (z2);
print (x3);

print("У нас дан прямоугольный прямоугольный треугольник с катетами 6 и 8. Нужно найти площадь, периметр и гипотенузу.")
print("Гипотенуза: ");
var v: Double = 6 * 6 ;
var z: Double = 8 * 8 ;
var q: Double = v + z ;
let w = sqrt(q);
print(w);
print("Площадь прямоугольного треугольника");
var r: Double = 8 * 6;
var y: Double = r / 2;
print(y);
print("Периметр прямоугольного треугольника: ")
var i: Double = 8 + 6 + 10;
print(i);



print("Мы рады приветствовать вас в нашем международном банке GeekBrainsCorporation!");
 

var a = 70000
var b = 5

 var c = (a / 100) * (100 + b);
 print("Сумма, которая будет на вашем счету через год: ");
print(c);
 var d =  (((a / 100) * (100 + b))/100) * (100 + b);
 print("Сумма, которая будет на вашем счету через два года: ");
print(d)
 var e = (((((a / 100) * (100 + b))/100) * (100 + b)) / 100) * (100 + b);
 print("Сумма, которая будет на вашем счету через три года: " );
print(e);
 var f = (((((((a / 100) * (100 + b))/100) * (100 + b)) / 100) * (100 + b)) / 100) * (100 + b);
 print("Сумма, которая будет на вашем счету через четыре года ");
print(f);
 var g = (((((((((a / 100) * (100 + b))/100) * (100 + b)) / 100) * (100 + b)) / 100) * (100 + b)) / 100) * (100 + b);
 print("Сумма, которая будет на вашем счету через пять лет ");
print(g);
 print("Спасибо, что использовали нашу программу!")

//изменения

